Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_showing_you_how_to_calculate_rent_supplement_in_2008.html.txt.tmx
Source language: en
Languages: ga

source: Case study: Calculating Rent Supplement
ga: Cás-staidéar: Forlíonadh Cíosa a Ríomh

source: This is an example showing how Rent Supplement is calculated in 2015
ga: Is sampla é seo a léiríonn conas a ríomhtar Forlíonadh Cíosa in 2015

source: Susan and Paul have 2 children aged 6 and 12
ga: Tá 2 leanaí atá 6 bliana d’aois agus 12 bhliain d’aois ag Susan agus Paul

source: Paul has been unemployed for 1 year but has recently found work and will start his new full-time job in a couple of weeks
ga: Tá Paul dífhostaithe le 1 bhliain ach tá obair faighte aige le déanaí agus tosóidh sé a phost lánaimseartha nua i gceann cúpla seachtain

source: His net income from work will be €440 each week
ga: An glanioncam a bheidh aige ón obair ná €440 gach seachtain

source: Susan had been getting half-rate Carer’s Allowance because Paul was getting Jobseeker’s Benefit and claiming for her as an adult dependant
ga: Bhí Susan ag fáil Liúntais do Chúramóirí ar leathráta toisc go raibh Paul ag fáil Sochar Cuardaitheora Poist agus ag éileamh di mar aosach cleithiúnach

source: When Paul returns to work she will get full-rate Carer’s Allowance
ga: Gheobhaidh sí an Liúntas do Chúramóirí ag an ráta iomlán nuair a fhilleann Paul chun na hoibre

source: She will not get any increases for their children because Paul's income is over €400 a week
ga: Ní bhfaighidh sí aon mhéaduithe dá leanaí mar go bhfuil ioncam Paul níos mó ná €400 sa tseachtain

source: Their 6-year old child is getting Domiciliary Care Allowance
ga: Tá a leanbh atá 6 bliana d'aois ag fáil Liúntas Cúram Baile

source: Their only other income is from Child Benefit
ga: An t-aon ioncam eile atá acu ná ó Shochar Linbh

source: However, they may also apply for Family Income Supplement when Paul starts work
ga: Mar sin féin, féadfaidh siad iarratas a dhéanamh freisin ar Fhorlíonadh ar Ioncam Teaghlaigh nuair a thosaíonn Paul ag obair

source: Susan wants to know if they can keep any of their Rent Supplement when Paul starts work
ga: Teastaíonn ó Susan a fháil amach an gcoinneoidh siad cuid ar bith den Fhorlíonadh Cíosa nuair a thosaíonn Paul ag obair

source: Their rent is €950 per month which is within the limit for their area
ga: Is ionann a gcíos agus €950 sa mhí, méid atá laistigh den teorainn le haghaidh a gceantair

source: They have been assessed by their local authority as in need of housing under the Rental Accommodation Scheme so they can retain their Rent Supplement while Paul is in full-time employment
ga: Mheas a n-údarás áitiúil go bhfuil siad ina lánúin a bhfuil tithíocht de dhíth orthu faoin Scéim um Chóiríocht ar Cíos le gur féidir leo a bhForlíonadh Cíosa a choinneáil agus Paul i mbun fostaíocht lánaimseartha

source: Step 1: Calculate the household's gross assessable weekly income from all sources
ga: Céim 1: Ollioncam seachtainiúil inmheasúnaithe an teaghlaigh ó gach foinse a ríomh

source: │Income source │Amount │
ga: │Foinse ioncaim │Méid │

source: │Assessable income from employment │€440 │
ga: │Ioncam inmheasúnaithe ó fhostaíocht │€440 │

source: │Carer's Allowance │€204 │
ga: │Liúntas do Chúramóirí │€204 │

source: │Family Income Supplement │€25.20 │
ga: │Forlíonadh ar Ioncam Teaghlaigh │€25.20 │

source: │Gross assessable weekly income │€669.20 │
ga: │Ollioncam seachtainiúil inmheasúnaithe │€669.20 │

source: Note that Child Benefit and Domiciliary Care Allowance are not included as income
ga: Tabhair faoi deara nach gcuirtear Sochar Linbh agus Liúntas Cúram Baile san áireamh mar ioncam

source: Susan may also get a Respite Care Grant in June from the Department of Social Protection
ga: Chomh maith leis sin, d’fhéadfadh Susan Liúntas Cúraim Sosa a fháil i mí an Mheithimh ón Roinn Coimirce Sóisialaí

source: The Respite Care Grant is not taken into account as income
ga: Ní chuirtear an Liúntas Cúraim Sosa san áireamh mar ioncam

source: Step 2: Find out what your income in excess of the Supplementary Welfare Allowance (SWA) rate is
ga: Céim 2: D’ioncam de bhreis ar an ráta Liúntais Leasa Fhorlíontaigh (SWA) a fháil amach

source: To do this you deduct the Over 65 disregard, the Carer’s disregard, travel costs, PRSI and the Appropriate SWA rate for your circumstances from your gross assessable income to find out what your income in excess of the SWA rate is
ga: D’fhonn é sin a dhéanamh, bain an neamhaird os cionn 65 bliain d’aois, an neamhaird do Chúramóirí, costais taistil, ÁSPC agus an Ráta SWA atá oiriúnach do do thosca as d’ollioncam inmheasúnaithe chun d’ioncam de bhreis ar an ráta SWA a fháil amach

source: │Gross assessable weekly income (see Step 1) │€669.20 │
ga: │Ollioncam seachtainiúil inmheasúnaithe (féach Céim 1) │€669.20 │

source: │Less Carer's disregard* │-€79.20 │
ga: │Lúide neamhaird do Chúramóirí* │-€79.20 │

source: │Less PRSI (4% of €440) │-€17.60 │
ga: │Lúide ÁSPC (4% de €440) │-€17.60 │

source: │Less appropriate SWA rate for a couple with 2 children │-€370.40 │
ga: │Lúide an ráta SWA atá oiriúnach do lánúin ag a bhfuil 2 leanaí │-€370.40 │

source: │Income in excess of the SWA rate │€202 │
ga: │Ioncam de bhreis ar an ráta SWA │€202 │

source: *The amount of Carer's Allowance (CA) in payment above the appropriate SWA rate for the carer is not taken into account
ga: *Ní chuirtear san áireamh méid an Liúntais do Chúramóirí (CA) atá á íoc os cionn an ráta SWA don chúramóir

source: The appropriate SWA rate for the carer is either the Increase for a Qualified Adult (if you are a couple) or the personal rate (if you are a single person)
ga: Is é an ráta SWA atá oiriúnach don chúramóir an Méadú do Dhuine Fásta Cáilithe (más lánúin sibh) nó an ráta pearsanta (más duine singil thú)

source: Susan is living with her partner Paul
ga: Tá Susan ina cónaí le Paul, a páirtnéir

source: The SWA rate for a qualified adult is subtracted from her Carer’s Allowance and the remainder is not taken into account
ga: Dealaítear an ráta SWA do dhuine fásta cáilithe óna Liúntas do Chúramóirí agus ní chuirtear an chuid atá fágtha san áireamh

source: Susan's Carer's disregard is €79.20
ga: Is é €79.20 an neamhaird do Chúramóirí atá ag Susan

source: Step 3: Calculate the Additional income disregard
ga: Céim 3: An neamhaird Ioncaim Bhreise a ríomh

source: │Additional income = (A+B) - C │Income │
ga: │Ioncam breise = (A+B) - C │Ioncam │

source: │A = Gross income from: │€440 │
ga: │A = Ollioncam ó: │€440 │

source: │ • Full or part-time work │€25.20 │
ga: │ • Obair lánaimseartha nó pháirtaimseartha │€25.20 │

source: │ • Family Income Supplement │ │
ga: │ • Forlíonadh ar Ioncam Teaghlaigh │ │

source: │Total A: │€465.20 │
ga: │Iomlán A: │€465.20 │

source: │B = assessable income from other sources: │€204 │
ga: │B = ioncam inmheasúnaithe ó fhoinsí eile │€204 │

source: │ • Carer’s Allowance/Benefit │-€79.20 │
ga: │ • Liúntas/Sochar do Chúramóirí │-€79.20 │

source: │ • Subtract Carer’s disregard (Subtract SWA IQA rate from actual carer's payment) │ │
ga: │ • Dealaigh an neamhaird do Chúramóirí (Dealaigh IQA an ráta SWA ón íocaíocht iarbhír do chúramóirí) │ │

source: │Total B: │€124.80 │
ga: │Iomlán B: │€124.80 │

source: │C = SWA rate for family circumstances │€370.40 │
ga: │C = ráta SWA d’imthosca teaghlaigh │€370.40 │

source: │Total C: │ │
ga: │Iomlán C: │ │

source: │(A+B) – C = Additional Income │€219.60 │
ga: │(A+B) – C = Ioncam Breise │€219.60 │

source: │Subtract PRSI, pension contributions, income continuance │-€17.60 │
ga: │Dealaigh ÁSPC, ranníocaíochtaí pinsin, leanúnachas ioncaim │-€17.60 │

source: │Additional Income for disregard │€202 │
ga: │Ioncam Breise a dtabharfar neamhaird air │€202 │

source: │If Additional Income for disregard is less than or equal to €75 this figure is the Additional income disregard
ga: │Más rud é go bhfuil Ioncam Breise a dtabharfar neamhaird air níos lú ná nó cothrom le €75, is é an figiúr sin an neamhaird Ioncaim Bhreise

source: │If not do this calculation: │ │
ga: │Mura bhfuil sé sin amhlaidh, déan an ríomh seo: │ │

source: │Subtract €75 │-€75 │
ga: │Dealaigh €75 │-€75 │

source: │25% of subtotal │€31.75 │
ga: │25% den fho-iomlán │€31.75 │

source: │Add €75 + 25% of subtotal to get Additional Income disregard │€106.75 │
ga: │Cuir €75 le 25% den fho-iomlán chun an neamhaird Ioncaim Bhreise a fháil │€106.75 │

source: Step 4: Subtract the Additional Income disregard from your income in excess of the SWA rate (figure at the end of Step 2)
ga: Céim 4: Dealaigh an neamhaird Ioncaim Bhreise ó d’ioncam de bhreis ar an ráta SWA (an figiúr ag deireadh Chéim 2)

source: This figure is your contribution from means
ga: Is é an figiúr seo do ranníocaíocht ó acmhainn

source: Income in excess of the SWA rate: €202
ga: Ioncam de bhreis ar an ráta SWA: €202

source: Less Additional Income disregard: €106.75
ga: Lúide an neamhaird Ioncaim Bhreise: €106.75

source: Contribution from means: €95.25
ga: Ranníocaíocht ó acmhainn: €95.25

source: Step 5: Find your total weekly contribution to rent by adding your contribution from means to your minimum Household Contribution
ga: Céim 5: Do ranníocaíocht sheachtainiúil iomlán i leith cíosa a aimsiú trí do ranníocaíocht ó acmhainn a chur le d’íos-Ranníocaíocht Teaghlaigh

source: Plus Minimum Household Contribution: €40
ga: Móide an Íos-ranníocaíocht Teaghlaigh: €40

source: Total weekly contribution to rent: €135.25
ga: Ranníocaíocht sheachtainiúil iomlán i leith cíosa: €135.25

source: You must pay a minimum contribution towards your rent in addition to any assessable income
ga: Ní mór duit íos-ranníocaíocht a íoc i leith do chíosa de bhreis ar aon ioncam inmheasúnaithe

source: This is €30 for a single person and €40 for a couple
ga: Is é sin €30 do dhuine singil agus €40 do lánúin

source: This minimum contribution may be increased depending on the number of non-dependent members in the household getting social welfare payments
ga: Féadfar an íos-ranníocaíocht sin a mhéadú ag brath ar líon na mball teaghlaigh neamhchleithiúnach atá ag fáil íocaíochtaí leasa shóisialaigh

source: In this case, the minimum household contribution is €40
ga: Sa chás seo, is é €40 an íos-ranníocaíocht teaghlaigh

source: Step 6: Find your Rent Supplement payment by subtracting your total weekly contribution to your rent from your weekly rent
ga: Céim 6: D’íocaíocht Forlíonadh Cíosa a fháil trí do ranníocaíocht sheachtainiúil iomlán i leith do chíosa a dhealú ó do chíos seachtainiúil

source: Susan and Paul are paying €950 per month for accommodation
ga: Tá Susan agus Paul ag íoc €950 sa mhí as cóiríocht

source: To get the weekly rent figure, multiply €950 by 12 and divide by 52
ga: D’fhonn figiúr an chíosa sheachtainiúil a fháil, iolraigh €950 faoi 12 agus roinn ar 52
